/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tobeshota <tobeshota@student.42.fr>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/04/26 20:35:53 by tobeshota         #+#    #+#             */
/*   Updated: 2023/05/19 16:14:28 by tobeshota        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/* 引数が数字かどうか判定する
 *
 * 数字とは，アスキーコード番号が48~57番であるものを指す
 * 数値とは，アスキーコード番号が0 ~ 9番であるものを指す
 *
 */
int	ft_isdigit(int c)
{
	return (c >= '0' && c <= '9');
}

// #include <stdio.h>
// #include <ctype.h>

// int	main(void)
// {
// 	int	c;

// 	c = '3';
// 	printf("ft:   %d\n", ft_isdigit(c));
// 	printf("libc: %d\n", isdigit(c));
// 	return (0);
// }
