/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tobeshota <tobeshota@student.42.fr>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/04/26 20:46:51 by tobeshota         #+#    #+#             */
/*   Updated: 2023/05/19 16:13:38 by tobeshota        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

//  引数が英数字かどうか判定する
int	ft_isalnum(int c)
{
	return (ft_isalpha(c) || ft_isdigit(c));
}
